app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts"  WHERE "posts"."id" = $1 LIMIT 1  [["id", 9]]
INSERT INTO "comments" ("author", "body", "created_at", "post_id", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["author", "dasd"], ["body", "dasd"], ["created_at", "2014-09-21 18:40:20.825782"], ["post_id", 9], ["updated_at", "2014-09-21 18:40:20.825782"]]
---
  def create
      @post = Post.find(params[:post_id])
      @comment = @post.comments.create!(comment_params) rescue nil