app/controllers/posts_controller.rb

  def index
    @posts = Post.where("publication_date <= ?", DateTime.now.to_date).order( 'publication_date DESC' )
---
SELECT "posts".* FROM "posts"  WHERE (publication_date <= '2014-09-21')  ORDER BY publication_date DESC

  def create
    @post = Post.new(post_params)

    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("body", "created_at", "publication_date", "title", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "dasda"], ["created_at", "2014-09-21 18:44:25.451778"], ["publication_date", "2014-09-21"], ["title", "dasd"], ["updated_at", "2014-09-21 18:44:25.451778"]]